# #-*- encoding: utf-8 -*-
# 1、简述
# OSI
# 七层协议。
#
# 2、什么是C / S和B / S架构？
#
# 3、简述
# 三次握手、四次挥手的流程。
#
# 4、什么是arp协议？
#
# 5、TCP和UDP的区别？
#
# 6、什么是局域网和广域网？
#
# 7、为何基于tcp协议的通信比基于udp协议的通信更可靠？
#
# 8、什么是socket？简述基于tcp协议的套接字通信流程。
#
# 9、什么是粘包？socket
# 中造成粘包的原因是什么？哪些情况会发生粘包现象？
#
# 10、IO多路复用的作用？
#
# 11、什么是防火墙以及作用？
#
# 12、select、poll、epoll
# 模型的区别？
#
# 13、简述
# 进程、线程、协程的区别
# 以及应用场景？
#
# 14、GIL锁是什么鬼？
#
# 15、Python中如何使用线程池和进程池？
#
# 16、threading.local的作用？
#
# 17、进程之间如何进行通信？
#
# 18、什么是并发和并行？
#
# 19、进程锁和线程锁的作用？
#
# 20、解释什么是异步非阻塞？
#
# 21、路由器和交换机的区别？
#
# 22、什么是域名解析？
#
# 23、如何修改本地hosts文件？
#
# 24、生产者消费者模型应用场景及优势？
#
# 25、什么是cdn？
#
# 26、LVS是什么及作用？
#
# 27、Nginx是什么及作用？
#
# 28、keepalived是什么及作用?
#
# 29、haproxy是什么以及作用？
#
# 30、什么是负载均衡？
#
# 31、什么是rpc及应用场景？
#
# 32、简述
# asynio模块的作用和应用场景。
#
# 33、简述
# gevent模块的作用和应用场景。
#
# 34、twisted框架的使用和应用？